# Install command:
# brew bundle install --file=Brewfile

tap "homebrew-ffmpeg/ffmpeg"
tap "cloudflare/cloudflare"

# Core CLI tools
brew "fish"
brew "starship"
brew "stow"

brew "coreutils"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "gotop"
brew "ripgrep"
brew "sd"
brew "neovim"
brew "openssh"

brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "bzip2"
brew "rlwrap"

# Network
brew "ldns"
brew "mtr"
brew "wget"

# Dev
brew "cmake"
brew "cloc"
brew "cookiecutter"
brew "eslint"
brew "gh"
brew "ghz"
brew "git"
brew "golang"
brew "golangci-lint"
brew "gosec"
brew "graphviz"
brew "httpie"
brew "iperf"
brew "nvm"
brew "pipx"
brew "svn"
brew "tectonic"
brew "deno"

# Security
brew "age"
brew "bcrypt"
brew "cfssl"
brew "nmap"
brew "semgrep"
brew "sha3sum"
brew "sipcalc"
brew "sslscan"
brew "ykman"


# CASKS

# System tools
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "cleanshot"
cask "contexts"
cask "cursorcerer"
cask "istat-menus"
cask "iterm2"
cask "little-snitch"
cask "logi-options+"
cask "monitorcontrol"
# cask "betterdisplay" # For non-HiDPI monitors
cask "rectangle-pro"

# Dev
cask "dash"
cask "gitkraken"
cask "intellij-idea-ce"
cask "orbstack"
cask "postman"
cask "sage"
cask "utm"
cask "visual-studio-code"
cask "wireshark"
cask "yaak"

# Media
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "calibre"
cask "dictionaries"
cask "elmedia-player"
cask "firefox"
cask "font-computer-modern"
cask "font-jetbrains-mono"
cask "obs"
cask "shureplus-motiv"
cask "the-unarchiver"

# Security
# Shows a files cryptographic signing information.
cask "whatsyoursign"
# Supercharged Activity monitor
cask "taskexplorer"
# KnockKnock uncovers persistently installed software in order to generically reveal such malware
cask "taskexplorer"
# a network monitor that lets you explore all sockets and connections through an interactive UI or the command line
cask "netiquette"

# Misc
cask "anki"
cask "burp-suite"
cask "discord"
cask "garmin-express"
cask "keepassxc"
cask "key-codes"
cask "obsidian"
cask "slack"
cask "steam"
cask "yubico-yubikey-manager"
cask "zoom"
