# Install command:
# brew bundle install --file=Brewfile

tap "daipeihust/tap" # im-select
tap "oven-sh/bun" # fast JavaScript all-in-one toolkit.
tap "terror/tap" # just-lsp

# Core CLI tools
brew "fish"
brew "starship"
brew "stow"

brew "bat"
brew "bash"
brew "uutils-coreutils"
brew "eza"
brew "fd"
brew "fzf"
brew "gotop"
brew "jq"
brew "ripgrep"
brew "sd" # Intuitive find and replace CLI command
brew "yazi"
brew "zoxide"

brew "glances"
brew "neovim"
brew "tree-sitter-cli"
brew "tmux"
brew "tree"
brew "grc"

brew "bzip2"
brew "poppler"
brew "rlwrap"
brew "unzip"

# Network
brew "ldns"
brew "mtr"
brew "wget"
cask "wireshark"

# System tools
brew "im-select"
cask "appcleaner"
cask "cleanshot"
cask "cursorcerer"
cask "istat-menus"
cask "ghostty"
cask "zed"
cask "little-snitch"
cask "logi-options+"
# cask "key-codes"
cask "betterdisplay"

# Dev
brew "bun"
brew "cloc"
brew "cmake"
brew "cookiecutter"
brew "deno"
brew "devcontainer"
brew "direnv"
brew "eslint"
brew "gh"
brew "ghz"
brew "git"
brew "git-lfs"
brew "golang"
brew "golangci-lint"
brew "gosec"
brew "httpie"
brew "iperf"
brew "just-lsp", tap: "terror/tap"
brew "ruff"
brew "rustup"
brew "tectonic"
brew "uv"

cask "dash"
cask "orbstack"
cask "hoppscotch"
cask "sage"
cask "utm"
cask "visual-studio-code"

# Security
brew "age"
brew "bcrypt"
brew "cfssl"
brew "gnupg"
brew "hashcat"
brew "nmap"
brew "semgrep"
brew "sha3sum"
brew "sipcalc"
brew "sslscan"

cask "burp-suite"
cask "proxyman"
cask "whatsyoursign" # Shows a files cryptographic signing information.
cask "taskexplorer" # Supercharged Activity monitor
cask "knockknock" # KnockKnock uncovers persistently installed software in order to generically reveal such malware

# Media
brew "imagemagick"
cask "calibre"
cask "dictionaries"
cask "elmedia-player"
cask "obs"
cask "the-unarchiver"

# Misc
cask "discord"
cask "slack"
cask "zoom"
