# Install command:
# brew bundle install --file=Brewfile

brew "age"
brew "coreutils"
brew "eslint"
brew "fzf"
brew "git"
brew "golang"
brew "golangci-lint"
brew "gosec"
brew "jq"
brew "mas"
brew "neovim"
brew "nmap"
brew "openssh"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tectonic"
brew "tldr"
brew "tmux"
brew "tree"
brew "gotop"
brew "exa"

brew "pipx"
brew "rlwrap"

brew "bat"
brew "bcrypt"
brew "bzip2"
brew "cfssl"
brew "cloc"
brew "cmake"
brew "cookiecutter"
brew "fd"
brew "sd"
brew "ghz"
brew "graphviz"
brew "httpie"
brew "iperf"
brew "ldns"
brew "mtr"
brew "semgrep"
brew "sha3sum"
brew "sipcalc"
brew "sslscan"
brew "unzip"
brew "wget"
brew "ykman"
brew "svn"

brew "hunspell"

cask "alfred"
cask "contexts"
cask "discord"
cask "docker"
cask "goldendict"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "1password"
cask "little-snitch"
cask "parallels"
cask "sage"
cask "utm"
cask "visual-studio-code"
cask "orbstack"

cask "homebrew/cask-drivers/obinskit"
cask "calibre"
cask "cursorcerer"
cask "devdocs"
cask "obs"
cask "postman"
cask "wireshark"
cask "zoom"
cask "elmedia-player"

tap "homebrew/cask-fonts"
cask "font-computer-modern"
cask "font-jetbrains-mono"

tap "github/gh"
brew "gh"
