{
  "Colorizer": { "branch": "master" },
  "async.vim": { "branch": "master" },
  "denite.nvim": { "branch": "master" },
  "github-nvim-theme": { "branch": "main" },
  "gitv": { "branch": "master" },
  "gundo.vim": { "branch": "master" },
  "hexmode": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lexima.vim": { "branch": "master" },
  "nerdtree": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "vim-airline": { "branch": "master" },
  "vim-airline-themes": { "branch": "master" },
  "vim-commentary": { "branch": "master" },
  "vim-fish": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-jsonnet": { "branch": "master" },
  "vim-lsp": { "branch": "master" },
  "vim-mustache-handlebars": { "branch": "master" },
  "vim-polyglot": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-signify": { "branch": "master" }
}
